Autodesk.Revit.DB.SynchronizeWithCentralOptions.SetRelinquishOptions(Autodesk.Revit.DB.RelinquishOptions)
Sets the options which govern whether or not to relinquish elements and workset types.
relinquishOptions:
The options.  If null, synchronize with central will relinquish the current user's ownership of all worksets and all elements.
Since:
2014

Autodesk.Revit.DB.SynchronizeWithCentralOptions.GetRelinquishOptions
Gets the options which govern whether or not to relinquish elements and workset types.
Returns:
The options.  If null, synchronize with central will relinquish the current user's ownership of all worksets and all elements.
Since:
2014

Autodesk.Revit.DB.SynchronizeWithCentralOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SynchronizeWithCentralOptions.SaveLocalFile
Indicates whether Revit will save the local file at least once while synchronizing with central.
Since:
2014

Autodesk.Revit.DB.SynchronizeWithCentralOptions.RelinquishBorrowedElements
Indicates whether Revit should relinquish borrowed elements after synchronizing with central.
Remarks:
This is a shortcut to access the value stored in Autodesk.Revit.DB.RelinquishOptions.CheckedOutElements.
Since:
2014

Autodesk.Revit.DB.SynchronizeWithCentralOptions.RelinquishUserCreatedWorksets
Indicates whether Revit should relinquish user-created Standard worksets after synchronizing with central.
Remarks:
This is a shortcut to access the value stored in Autodesk.Revit.DB.RelinquishOptions.UserWorksets.
Since:
2014

Autodesk.Revit.DB.SynchronizeWithCentralOptions.RelinquishViewWorksets
Indicates whether Revit should relinquish View worksets after synchronizing with central.
Remarks:
This is a shortcut to access the value stored in Autodesk.Revit.DB.RelinquishOptions.ViewWorksets.
Since:
2014

Autodesk.Revit.DB.SynchronizeWithCentralOptions.RelinquishFamilyWorksets
Indicates whether Revit should relinquish Family worksets after synchronizing with central.
Remarks:
This is a shortcut to access the value stored in Autodesk.Revit.DB.RelinquishOptions.FamilyWorksets.
Since:
2014

Autodesk.Revit.DB.SynchronizeWithCentralOptions.RelinquishProjectStandardWorksets
Indicates whether Revit should relinquish Project Standard worksets after synchronizing with central.
Remarks:
This is a shortcut to access the value stored in Autodesk.Revit.DB.RelinquishOptions.StandardWorksets.
Since:
2014

Autodesk.Revit.DB.SynchronizeWithCentralOptions.EnableCloudWorksharing
True means enable cloud worksharing in this operation, false means it is a common synchronization
Since:
2014

Autodesk.Revit.DB.SynchronizeWithCentralOptions.SaveLocalAfter
True means to save local after saving changes to central.  True by default.
Silently ignored if the model in the current session is central rather than local.
Remarks:
It is recommended practice to save local after SWC because otherwise local becomes incompatible with central.
Since:
2014

Autodesk.Revit.DB.SynchronizeWithCentralOptions.Comment
User description of changes made since the last Sync with Central.  Empty by default.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: comment has more than 30,000 characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.SynchronizeWithCentralOptions.Compact
Indicates whether Revit should compact the central model while synchronizing with central.
This option reduces the size of the central model but many increase the time it takes to perform the save.
False by default.
Since:
2014

Autodesk.Revit.DB.SynchronizeWithCentralOptions.SaveLocalBefore
True means to save local before the first reload latest if there are changes not yet saved to local.
True by default.  Silently ignored if the model in the current session is central rather than local.
Since:
2014

Autodesk.Revit.DB.SynchronizeWithCentralOptions.#ctor
Constructs a new instance of SynchronizeWithCentralOptions initialized with default options.
Since:
2014

Autodesk.Revit.DB.SynchronizeWithCentralOptions
Options to control behavior of synchronization with central.
Since:
2014